{"class_name": "Model", "config": {"name": "model_52", "layers": [{"name": "input_29", "class_name": "InputLayer", "config": {"batch_input_shape": [10000, 784], "dtype": "float32", "sparse": false, "name": "input_29"}, "inbound_nodes": []}, {"name": "reshape_27", "class_name": "Reshape", "config": {"name": "reshape_27", "trainable": true, "dtype": "float32", "target_shape": [28, 28, 1]}, "inbound_nodes": [[["input_29", 0, 0, {}]]]}, {"name": "conv2d_38", "class_name": "Conv2D", "config": {"name": "conv2d_38", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_27", 0, 0, {}]]]}, {"name": "max_pooling2d_17", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_17", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"name": "conv2d_39", "class_name": "Conv2D", "config": {"name": "conv2d_39", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]]}, {"name": "max_pooling2d_18", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_18", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_39", 0, 0, {}]]]}, {"name": "reshape_28", "class_name": "Reshape", "config": {"name": "reshape_28", "trainable": true, "dtype": "float32", "target_shape": [392]}, "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]]}, {"name": "dense_141", "class_name": "Dense", "config": {"name": "dense_141", "trainable": true, "dtype": "float32", "units": 150, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_28", 0, 0, {}]]]}, {"name": "z_mean", "class_name": "Dense", "config": {"name": "z_mean", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_141", 0, 0, {}]]]}, {"name": "z_variance", "class_name": "Dense", "config": {"name": "z_variance", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_141", 0, 0, {}]]]}, {"name": "lambda_27", "class_name": "Lambda", "config": {"name": "lambda_27", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAABgAAAAQAAABDAAAAcyoAAAB8AFwCfQN9BHQAagF8AXwCZgJkAY0BfQV8A3QAoAJ8\nBKEBfAUUABcAUwApAk4pAdoFc2hhcGUpA9oBS9oNcmFuZG9tX25vcm1hbNoDZXhwKQbaD3ByZXZp\nb3VzX2xheWVyc9oKYmF0Y2hfc2l6ZdoIZGVzdF9kaW3aBnpfbWVhbtoKel92YXJpYW5jZdoHZXBz\naWxvbqkAcgsAAAD6HzxpcHl0aG9uLWlucHV0LTQyLTg4MTkxZjE3MDc1YT7aCHNhbXBsaW5nAQAA\nAHMGAAAAAAEIARAC\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"batch_size": 10000, "dest_dim": 50}}, "inbound_nodes": [[["z_mean", 0, 0, {}], ["z_variance", 0, 0, {}]]]}], "input_layers": [["input_29", 0, 0]], "output_layers": [["lambda_27", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}