{"class_name": "Model", "config": {"name": "model_64", "layers": [{"name": "input_35", "class_name": "InputLayer", "config": {"batch_input_shape": [10000, 784], "dtype": "float32", "sparse": false, "name": "input_35"}, "inbound_nodes": []}, {"name": "dense_161", "class_name": "Dense", "config": {"name": "dense_161", "trainable": true, "dtype": "float32", "units": 417, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_35", 0, 0, {}]]]}, {"name": "dense_162", "class_name": "Dense", "config": {"name": "dense_162", "trainable": true, "dtype": "float32", "units": 233, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_161", 0, 0, {}]]]}, {"name": "z_mean", "class_name": "Dense", "config": {"name": "z_mean", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_162", 0, 0, {}]]]}, {"name": "z_variance", "class_name": "Dense", "config": {"name": "z_variance", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_162", 0, 0, {}]]]}, {"name": "lambda_33", "class_name": "Lambda", "config": {"name": "lambda_33", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAABgAAAAQAAABDAAAAcyoAAAB8AFwCfQN9BHQAagF8AXwCZgJkAY0BfQV8A3QAoAJ8\nBKEBfAUUABcAUwApAk4pAdoFc2hhcGUpA9oBS9oNcmFuZG9tX25vcm1hbNoDZXhwKQbaD3ByZXZp\nb3VzX2xheWVyc9oKYmF0Y2hfc2l6ZdoIZGVzdF9kaW3aBnpfbWVhbtoKel92YXJpYW5jZdoHZXBz\naWxvbqkAcgsAAAD6HzxpcHl0aG9uLWlucHV0LTQyLTg4MTkxZjE3MDc1YT7aCHNhbXBsaW5nAQAA\nAHMGAAAAAAEIARAC\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"batch_size": 10000, "dest_dim": 50}}, "inbound_nodes": [[["z_mean", 0, 0, {}], ["z_variance", 0, 0, {}]]]}], "input_layers": [["input_35", 0, 0]], "output_layers": [["lambda_33", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}