{"class_name": "Model", "config": {"name": "model_14", "layers": [{"name": "input_35", "class_name": "InputLayer", "config": {"batch_input_shape": [10000, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input_35"}, "inbound_nodes": []}, {"name": "conv2d_105", "class_name": "Conv2D", "config": {"name": "conv2d_105", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_35", 0, 0, {}]]]}, {"name": "max_pooling2d_56", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_56", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_105", 0, 0, {}]]]}, {"name": "conv2d_106", "class_name": "Conv2D", "config": {"name": "conv2d_106", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_56", 0, 0, {}]]]}, {"name": "max_pooling2d_57", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_57", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_106", 0, 0, {}]]]}, {"name": "reshape_56", "class_name": "Reshape", "config": {"name": "reshape_56", "trainable": true, "dtype": "float32", "target_shape": [392]}, "inbound_nodes": [[["max_pooling2d_57", 0, 0, {}]]]}, {"name": "dense_127", "class_name": "Dense", "config": {"name": "dense_127", "trainable": true, "dtype": "float32", "units": 150, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_56", 0, 0, {}]]]}, {"name": "dense_128", "class_name": "Dense", "config": {"name": "dense_128", "trainable": true, "dtype": "float32", "units": 15, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_127", 0, 0, {}]]]}, {"name": "dense_129", "class_name": "Dense", "config": {"name": "dense_129", "trainable": true, "dtype": "float32", "units": 15, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_127", 0, 0, {}]]]}, {"name": "lambda_21", "class_name": "Lambda", "config": {"name": "lambda_21", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABAAAAAQAAABDAAAAcyoAAAB8AFwCfQF9AnQAagF0AnQDZgJkAY0BfQN8AXQAoAR8\nAqEBfAMUABcAUwApAk4pAdoFc2hhcGUpBdoBS9oNcmFuZG9tX25vcm1hbNoKYmF0Y2hfc2l6ZdoI\nZGVzdF9kaW3aA2V4cCkE2gRhcmdz2gZ6X21lYW7aCnpfdmFyaWFuY2XaB2Vwc2lsb26pAHILAAAA\n+iA8aXB5dGhvbi1pbnB1dC0xNTAtYjRhNGNhNmQ2M2JmPtoIc2FtcGxpbmcBAAAAcwYAAAAAAQgB\nEAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_128", 0, 0, {}], ["dense_129", 0, 0, {}]]]}, {"name": "dense_130", "class_name": "Dense", "config": {"name": "dense_130", "trainable": true, "dtype": "float32", "units": 150, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_21", 0, 0, {}]]]}, {"name": "dense_131", "class_name": "Dense", "config": {"name": "dense_131", "trainable": true, "dtype": "float32", "units": 392, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_130", 0, 0, {}]]]}, {"name": "reshape_57", "class_name": "Reshape", "config": {"name": "reshape_57", "trainable": true, "dtype": "float32", "target_shape": [7, 7, 8]}, "inbound_nodes": [[["dense_131", 0, 0, {}]]]}, {"name": "conv2d_107", "class_name": "Conv2D", "config": {"name": "conv2d_107", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_57", 0, 0, {}]]]}, {"name": "up_sampling2d_34", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_34", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_107", 0, 0, {}]]]}, {"name": "conv2d_108", "class_name": "Conv2D", "config": {"name": "conv2d_108", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_34", 0, 0, {}]]]}, {"name": "up_sampling2d_35", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_35", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_108", 0, 0, {}]]]}, {"name": "conv2d_109", "class_name": "Conv2D", "config": {"name": "conv2d_109", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_35", 0, 0, {}]]]}, {"name": "reshape_58", "class_name": "Reshape", "config": {"name": "reshape_58", "trainable": true, "dtype": "float32", "target_shape": [784]}, "inbound_nodes": [[["conv2d_109", 0, 0, {}]]]}], "input_layers": [["input_35", 0, 0]], "output_layers": [["reshape_58", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}