{"class_name": "Model", "config": {"name": "model_25", "layers": [{"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [10000, 784], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "dense_85", "class_name": "Dense", "config": {"name": "dense_85", "trainable": true, "dtype": "float32", "units": 392, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "dense_86", "class_name": "Dense", "config": {"name": "dense_86", "trainable": true, "dtype": "float32", "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_85", 0, 0, {}]]]}, {"name": "dense_87", "class_name": "Dense", "config": {"name": "dense_87", "trainable": true, "dtype": "float32", "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_85", 0, 0, {}]]]}, {"name": "lambda_15", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABAAAAAQAAABDAAAAcyoAAAB8AFwCfQF9AnQAagF0AnQDZgJkAY0BfQN8AXQAoAR8\nAqEBfAMUABcAUwApAk4pAdoFc2hhcGUpBdoBS9oNcmFuZG9tX25vcm1hbNoKYmF0Y2hfc2l6ZdoI\nZGVzdF9kaW3aA2V4cCkE2gRhcmdz2gZ6X21lYW7aCnpfdmFyaWFuY2XaB2Vwc2lsb26pAHILAAAA\n+h88aXB5dGhvbi1pbnB1dC04Mi05YTFlZGZkNTIxNGQ+2ghzYW1wbGluZwEAAABzBgAAAAABCAEQ\nAg==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_86", 0, 0, {}], ["dense_87", 0, 0, {}]]]}, {"name": "dense_88", "class_name": "Dense", "config": {"name": "dense_88", "trainable": true, "dtype": "float32", "units": 392, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_15", 0, 0, {}]]]}, {"name": "dense_89", "class_name": "Dense", "config": {"name": "dense_89", "trainable": true, "dtype": "float32", "units": 784, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_88", 0, 0, {}]]]}], "input_layers": [["input_15", 0, 0]], "output_layers": [["dense_89", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}